

// APIURL
const API_KEY = 'api_key=5d7ac24e63419994fda11db9f90c8f2b';
const BASE_URL ='https://api.themoviedb.org/3';
const API_URL = BASE_URL + '/discover/movie?sort_by=popularity.desc&'+API_KEY;

const IMG_URL= 'https://image.tmdb.org/t/p/w500';
const searchURL = BASE_URL+'/search/movie?'+API_KEY;

const main = document.getElementById('main');
const form = document.getElementById('form');
const search = document.getElementById('search');

getMovies(API_URL);

function getMovies(url){
    fetch(url).then(res => res.json()).then(data =>{
        console.log(data.results);
        showMovies(data.results);
    })
}


function showMovies(data){
    main.innerHTML = '';

    data.forEach(movie =>{        
        const {title,poster_path,overview,release_date,vote_average} = movie;
        const movieEL = document.createElement('div');
        movieEL.classList.add('movie');
        movieEL.innerHTML=
            `
            <img src="${IMG_URL+poster_path}" alt="${title}">
           
            <div class="movieInfo">
                <h3>${title}</h3>
                <span class="${getColor(vote_average)}">${vote_average}</span>
            </div>

            <div class="date">
                <p>${release_date}</p>
            </div>

            <div class="overView">
                <h3>overview</h3>
                ${overview};
            </div>`


            main.appendChild(movieEL);
    })

    }


    //  評分投票
     function getColor(vote){
        if(vote>=8){
            return'green'
        }else if(vote >=5){
            return'orange'
        }else{
            return 'red'
        }
     }


     form.addEventListener('submit', (e) => {
        e.preventDefault();
        const searchTerm = search.value;

    if(searchTerm){
        getMovies(searchURL+'&query='+searchTerm)
    }else{
        // 搜尋清空就回主畫面
        getMovies(API_URL);
    }
})





let movieBud = [
    {
      "事業名稱": "新光天母影城",
      "公司名稱": "新光影城股份有限公司台北天母分公司",
      "統一編號": 90665077,
      "廳數": 8,
      "地址": "台北市士林區忠誠路2段202號4~9樓",
      "電話": "02-28763300",
      "備註": ""
    },
    {
      "事業名稱": "國賓大戲院",
      "公司名稱": "國賓企業股份有限公司",
      "統一編號": 15324301,
      "廳數": 3,
      "地址": "台北市成都路88號",
      "電話": "02-23611223",
      "備註": ""
    },
    {
      "事業名稱": "台北新光影城",
      "公司名稱": "新光三越百貨股份有限公司台北獅子林分公司",
      "統一編號": 70749633,
      "廳數": 3,
      "地址": "台北市萬華區西寧南路36號4樓",
      "電話": "02-23146668",
      "備註": ""
    },
    {
      "事業名稱": "樂聲大戲院",
      "公司名稱": "樂聲大戲院股份有限公司",
      "統一編號": "03583704",
      "廳數": 4,
      "地址": "台北市萬華區武昌街2段85號1~5樓",
      "電話": "02-23118628",
      "備註": ""
    },
    {
      "事業名稱": "in89豪華數位影城",
      "公司名稱": "豪華大戲院股份有限公司",
      "統一編號": "03539102",
      "廳數": 3,
      "地址": "台北市武昌街2段89號",
      "電話": "02-23315077",
      "備註": ""
    },
    {
      "事業名稱": "in89豪華數位影城",
      "公司名稱": "映捌玖數位影城有限公司",
      "統一編號": 54186685,
      "廳數": 4,
      "地址": "台北市武昌街2段89號",
      "電話": "02-23315077",
      "備註": ""
    },
    {
      "事業名稱": "今日秀泰影城",
      "公司名稱": "萬華企業股份有限公司",
      "統一編號": 15415013,
      "廳數": 10,
      "地址": "台北市峨嵋街52號4.6.8樓",
      "電話": "02-23814272",
      "備註": ""
    },
    {
      "事業名稱": "喜滿客絕色電影城",
      "公司名稱": "絕色影城股份有限公司",
      "統一編號": 80192629,
      "廳數": 9,
      "地址": "台北市萬華區漢中街52號8至11樓",
      "電話": "02-23811339",
      "備註": ""
    },
    {
      "事業名稱": "真善美劇院",
      "公司名稱": "中影股份有限公司真善美分公司",
      "統一編號": 97293474,
      "廳數": 2,
      "地址": "台北市漢中街116號7樓",
      "電話": "02-23312270",
      "備註": ""
    },
    {
      "事業名稱": "光點",
      "公司名稱": "三視多媒體網路股份有限公司",
      "統一編號": 70655641,
      "廳數": 1,
      "地址": "台北市中山北路2段18號",
      "電話": "02-25117786",
      "備註": ""
    },
    {
      "事業名稱": "華山電影藝術館",
      "公司名稱": "三三電影製作有限公司",
      "統一編號": 15975423,
      "廳數": 2,
      "地址": "台北市中正區八德路一段1號",
      "電話": "02-23940622",
      "備註": ""
    },
    {
      "事業名稱": "台北京站威秀影城",
      "公司名稱": "威秀影城股份有限公司京站分公司",
      "統一編號": 28984678,
      "廳數": 9,
      "地址": "台北市大同區華陰街34號5、6樓",
      "電話": "02-25525511",
      "備註": ""
    },
    {
      "事業名稱": "龍祥百老匯影城",
      "公司名稱": "龍祥育樂多媒體股份有限公司臺北分公司",
      "統一編號": 16289859,
      "廳數": 7,
      "地址": "台北市文山區羅斯福路四段200號3、4、5樓",
      "電話": "02-86636128",
      "備註": ""
    },
    {
      "事業名稱": "東南亞秀泰影城",
      "公司名稱": "東南亞育樂股份有限公司",
      "統一編號": 18748606,
      "廳數": 6,
      "地址": "台北市羅斯福路4段136巷3號",
      "電話": "02-23678999",
      "備註": ""
    },
    {
      "事業名稱": "湳山戲院",
      "公司名稱": "南山大戲院",
      "統一編號": "04920795",
      "廳數": 4,
      "地址": "台北市通化街24巷1號",
      "電話": "02-27023130",
      "備註": ""
    },
    {
      "事業名稱": "梅花數位影院",
      "公司名稱": "中影股份有限公司梅花分公司",
      "統一編號": 97302430,
      "廳數": 2,
      "地址": "台北市和平東路三段63號2樓",
      "電話": "02-27326968",
      "備註": ""
    },
    {
      "事業名稱": "總督大戲院",
      "公司名稱": "船興企業股份有限公司",
      "統一編號": "05148262",
      "廳數": 1,
      "地址": "台北市松山區長安東路2段219號3、4樓",
      "電話": "02-27415991",
      "備註": ""
    },
    {
      "事業名稱": "首都戲院",
      "公司名稱": "龍子電影事業股份有限公司",
      "統一編號": 21235165,
      "廳數": 1,
      "地址": "台北市松山區長安東路2段219號2、3樓",
      "電話": "02-27415991",
      "備註": ""
    },
    {
      "事業名稱": "新民生戲院",
      "公司名稱": "民生戲院股份有限公司",
      "統一編號": 53563725,
      "廳數": 2,
      "地址": "台北市松山區民生東路五段190號3樓",
      "電話": "02-27653373",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@台北長春廣場",
      "公司名稱": "國元影業股份有限公司長春分公司",
      "統一編號": 25122923,
      "廳數": 2,
      "地址": "台北市中山區長春路172號2至3樓、地下1樓",
      "電話": "02-25155757",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@台北長春廣場",
      "公司名稱": "國元影業股份有限公司",
      "統一編號": 25116865,
      "廳數": 13,
      "地址": "台北市中山區長春路176號2F、3F、B2、B3",
      "電話": "02-25155757",
      "備註": ""
    },
    {
      "事業名稱": "欣欣秀泰影城",
      "公司名稱": "欣欣大眾市場股份有限公司",
      "統一編號": 11364230,
      "廳數": 14,
      "地址": "台北市中山區林森北路247號3、4、5樓",
      "電話": "02-25371889",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@微風廣場",
      "公司名稱": "國賓影城股份有限公司微風分公司",
      "統一編號": 70795468,
      "廳數": 6,
      "地址": "台北市松山區復興南路1段39號8、10樓",
      "電話": "02-87721234",
      "備註": ""
    },
    {
      "事業名稱": "美麗華大直影城",
      "公司名稱": "美麗華娛樂股份有限公司",
      "統一編號": 16604391,
      "廳數": 10,
      "地址": "台北市敬業3路22號6樓",
      "電話": "02-85022208",
      "備註": ""
    },
    {
      "事業名稱": "哈拉影城",
      "公司名稱": "哈拉影城有限公司",
      "統一編號": 70436436,
      "廳數": 8,
      "地址": "台北市內湖區康寧路3段72號2樓之1、之2、3樓之1、之2",
      "電話": "02-26322693",
      "備註": ""
    },
    {
      "事業名稱": "佳佳來來戲院",
      "公司名稱": "弘美育樂股份有限公司",
      "統一編號": "04873385",
      "廳數": 5,
      "地址": "台北市文山區羅斯福路六段403號4樓",
      "電話": "02-29346494",
      "備註": ""
    },
    {
      "事業名稱": "華威天母影城",
      "公司名稱": "華威影城有限公司",
      "統一編號": 27310984,
      "廳數": 8,
      "地址": "台北市士林區忠誠路2段202號4~8樓",
      "電話": "02-28763300",
      "備註": ""
    },
    {
      "事業名稱": "台北信義威秀影城",
      "公司名稱": "威秀影城股份有限公司信義分公司",
      "統一編號": 16431011,
      "廳數": 17,
      "地址": "台北市信義區松壽路18號2、3樓， 20號3樓",
      "電話": "02-87805566",
      "備註": ""
    },
    {
      "事業名稱": "誠品電影院",
      "公司名稱": "誠品股份有限公司",
      "統一編號": 23155531,
      "廳數": 3,
      "地址": "台北市信義區菸廠路80號B2",
      "電話": "02-66365888",
      "備註": ""
    },
    {
      "事業名稱": "喜樂時代影城",
      "公司名稱": "喜樂時代影城股份有限公司南港分公司",
      "統一編號": 42828452,
      "廳數": 25,
      "地址": "臺北市南港區忠孝東路7段299號11、12、13、14樓",
      "電話": "02-27888185",
      "備註": ""
    },
    {
      "事業名稱": "MUVIE CINEMAS威秀影城",
      "公司名稱": "威秀影城股份有限公司松仁分公司",
      "統一編號": 54915305,
      "廳數": 8,
      "地址": "臺北市信義區松仁路58號10、11、12、13樓",
      "電話": "02-87800800",
      "備註": ""
    },
    {
      "事業名稱": "天台戲院",
      "公司名稱": "天台戲院股份有限公司",
      "統一編號": 35078600,
      "廳數": 5,
      "地址": "新北市三重區重新路二段78號4樓",
      "電話": "02-29784614",
      "備註": ""
    },
    {
      "事業名稱": "板橋秀泰影城",
      "公司名稱": "板球秀泰影城有限公司",
      "統一編號": 54015819,
      "廳數": 17,
      "地址": "新北市板橋區縣民大道二段3號2-4樓",
      "電話": "02-29685588",
      "備註": ""
    },
    {
      "事業名稱": "板橋大遠百威秀影城",
      "公司名稱": "威秀影城股份有限公司板橋分公司",
      "統一編號": 53019247,
      "廳數": 9,
      "地址": "新北市板橋區新站路28號10樓",
      "電話": "02-77386608",
      "備註": ""
    },
    {
      "事業名稱": "林園電影城",
      "公司名稱": "林園電影城戲院",
      "統一編號": "08563729",
      "廳數": 3,
      "地址": "新北市板橋區府中路175號3樓",
      "電話": "02-29606099",
      "備註": ""
    },
    {
      "事業名稱": "林園電影城",
      "公司名稱": "華麗電影院",
      "統一編號": 95891495,
      "廳數": 2,
      "地址": "新北市板橋區府中路175號5樓",
      "電話": "02-29605333",
      "備註": ""
    },
    {
      "事業名稱": "鴻金寶麻吉影城",
      "公司名稱": "萬念福開發事業股份有限公司",
      "統一編號": 89578933,
      "廳數": 5,
      "地址": "新北市新莊區民安路188巷5號4樓",
      "電話": "02-22070222",
      "備註": ""
    },
    {
      "事業名稱": "中和環球威秀影城",
      "公司名稱": "威秀影城股份有限公司中和環球分公司",
      "統一編號": 90884039,
      "廳數": 10,
      "地址": "新北市中和區中山路3段122號4樓",
      "電話": "02-82266063",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@林口昕境廣場",
      "公司名稱": "國賓影城股份有限公司林口分公司",
      "統一編號": 24935022,
      "廳數": 8,
      "地址": "新北市林口區文化三路一段402巷2號4樓",
      "電話": "02-26080011",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@新莊晶冠廣場",
      "公司名稱": "國賓影城股份有限公司新莊分公司",
      "統一編號": 24964285,
      "廳數": 13,
      "地址": "新北市新莊區五工路66號3樓及4樓",
      "電話": "02-85216517",
      "備註": ""
    },
    {
      "事業名稱": "林口MITSUI OUTLET PARK威秀影城",
      "公司名稱": "威秀影城股份有限公司新北林口分公司",
      "統一編號": 24808911,
      "廳數": 9,
      "地址": "新北市林口區文化三路1段356號3樓",
      "電話": "02-26084750",
      "備註": ""
    },
    {
      "事業名稱": "樹林秀泰影城",
      "公司名稱": "樹林秀泰影城股份有限公司",
      "統一編號": 69421836,
      "廳數": 12,
      "地址": "新北市樹林區樹新路40之6號",
      "電話": "02-26868769",
      "備註": ""
    },
    {
      "事業名稱": "土城秀泰影城",
      "公司名稱": "土城秀泰影城股份有限公司",
      "統一編號": 66629312,
      "廳數": 11,
      "地址": "新北市土城區學府路2段210號1樓",
      "電話": "02-22603398",
      "備註": ""
    },
    {
      "事業名稱": "美麗新淡海影城",
      "公司名稱": "美麗新娛樂股份有限公司淡海分公司",
      "統一編號": 50878692,
      "廳數": 9,
      "地址": "新北市淡水區義山路2段303號2～4樓",
      "電話": "02-77050899",
      "備註": ""
    },
    {
      "事業名稱": "美麗新宏匯影城",
      "公司名稱": "美麗新娛樂股份有限公司新莊分公司",
      "統一編號": 83774698,
      "廳數": 12,
      "地址": "新北市新莊區新北大道4段3號8-12樓",
      "電話": "02-77179788",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@淡水禮萊廣場",
      "公司名稱": "國賓影城股份有限公司淡水分公司",
      "統一編號": 82910127,
      "廳數": 8,
      "地址": "新北市淡水區中正路一段2號",
      "電話": "02-26260707",
      "備註": ""
    },
    {
      "事業名稱": "全球影城",
      "公司名稱": "亮威股份有限公司",
      "統一編號": 97219643,
      "廳數": 7,
      "地址": "台中市中區中華路一段1之1號，B1-5, B2-5, 3F-1, 4F-1",
      "電話": "04-22242588",
      "備註": ""
    },
    {
      "事業名稱": "日日新大戲院",
      "公司名稱": "日日新國際商業股份有限公司",
      "統一編號": 97265890,
      "廳數": 5,
      "地址": "台中市中區中華路一段58號1至10樓",
      "電話": "04-22223138",
      "備註": ""
    },
    {
      "事業名稱": "萬代福戲院",
      "公司名稱": "桂冠育樂股份有限公司",
      "統一編號": 52664555,
      "廳數": 5,
      "地址": "台中市中區公園路38號3樓、4樓、B1",
      "電話": "04-22265270",
      "備註": ""
    },
    {
      "事業名稱": "豐源國際影城",
      "公司名稱": "豐源育樂有限公司",
      "統一編號": "05697668",
      "廳數": 4,
      "地址": "台中市豐原區中正路137號1、2、3樓",
      "電話": "04-25260036",
      "備註": ""
    },
    {
      "事業名稱": "台中大遠百威秀影城",
      "公司名稱": "威秀影城股份有限公司惠中分公司",
      "統一編號": 53018958,
      "廳數": 7,
      "地址": "台中市西屯區台中港路二段105號13樓",
      "電話": "04-22588511",
      "備註": ""
    },
    {
      "事業名稱": "台中新光影城",
      "公司名稱": "新光影城股份有限公司台中中港分公司",
      "統一編號": 70784899,
      "廳數": 8,
      "地址": "台中市西屯區台中港路二段111號13、14樓",
      "電話": "04-22589911",
      "備註": ""
    },
    {
      "事業名稱": "台中新時代威秀影城",
      "公司名稱": "威秀影城股份有限公司台中東區分公司",
      "統一編號": 12942667,
      "廳數": 9,
      "地址": "台中市東區復興路4段186號4、5樓",
      "電話": "04-36085566",
      "備註": ""
    },
    {
      "事業名稱": "親親大戲院",
      "公司名稱": "親親育樂股份有限公司",
      "統一編號": 22068524,
      "廳數": 7,
      "地址": "台中市北區錦洲里北屯路14號",
      "電話": "04-22319111",
      "備註": ""
    },
    {
      "事業名稱": "台中Tiger City威秀影城",
      "公司名稱": "威秀影城股份有限公司台中西屯區分公司",
      "統一編號": 12963016,
      "廳數": 10,
      "地址": "台中市西屯區河南路三段120-1號4樓",
      "電話": "04-36065566",
      "備註": ""
    },
    {
      "事業名稱": "時代戲院",
      "公司名稱": "時代戲院",
      "統一編號": 56083517,
      "廳數": 6,
      "地址": "台中市清水區文昌里光復街65號3樓",
      "電話": "04-26222206",
      "備註": ""
    },
    {
      "事業名稱": "凱擘影城",
      "公司名稱": "凱擘影藝股份有限公司台中東區分公司",
      "統一編號": 51160612,
      "廳數": 9,
      "地址": "台中市東區復興路4段186號4、5樓",
      "電話": "04-36080900",
      "備註": ""
    },
    {
      "事業名稱": "台中站前秀泰影城",
      "公司名稱": "台中站前秀泰影城股份有限公司",
      "統一編號": 60299530,
      "廳數": 17,
      "地址": "台中市東區南京路76號",
      "電話": "04-22117988",
      "備註": ""
    },
    {
      "事業名稱": "台中文心秀泰影城",
      "公司名稱": "台中文心秀泰影城股份有限公司",
      "統一編號": 50816675,
      "廳數": 16,
      "地址": "台中市南屯區文心南路289號7～8樓",
      "電話": "04-24735989",
      "備註": ""
    },
    {
      "事業名稱": "台中麗寶秀泰影城",
      "公司名稱": "麗寶秀泰影城股份有限公司",
      "統一編號": 85040051,
      "廳數": 10,
      "地址": "台中市后里區月眉東路二段181號3樓",
      "電話": "04-2558-7180",
      "備註": ""
    },
    {
      "事業名稱": "台南仁德秀泰影城",
      "公司名稱": "台南仁德秀泰影城股份有限公司",
      "統一編號": 85079837,
      "廳數": 6,
      "地址": "臺南市仁德區仁愛里大同路三段759號2樓",
      "電話": "06-2691889",
      "備註": ""
    },
    {
      "事業名稱": "全美戲院",
      "公司名稱": "全美戲院有限公司",
      "統一編號": 68209998,
      "廳數": 2,
      "地址": "台南市永福路二段187號",
      "電話": "06-2224726",
      "備註": ""
    },
    {
      "事業名稱": "今日戲院",
      "公司名稱": "今日大戲院有限公司",
      "統一編號": 13125398,
      "廳數": 1,
      "地址": "台南市中正路249號2樓",
      "電話": "06-2222265",
      "備註": ""
    },
    {
      "事業名稱": "台南大遠百威秀影城",
      "公司名稱": "威秀影城股份有限公司台南分公司",
      "統一編號": 80332430,
      "廳數": 9,
      "地址": "台南市公園路60號5~13樓",
      "電話": "06-6005566",
      "備註": ""
    },
    {
      "事業名稱": "台南新光影城",
      "公司名稱": "新光影城股份有限公司台南西門分公司",
      "統一編號": 80511807,
      "廳數": 8,
      "地址": "台南市西門路一段658號9、10、11、12樓",
      "電話": "06-3031260",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@台南國賓廣場",
      "公司名稱": "國賓影城股份有限公司台南中華分公司",
      "統一編號": 70826912,
      "廳數": 5,
      "地址": "台南市中華東路一段66-70號",
      "電話": "06-2347166",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@台南國賓廣場",
      "公司名稱": "國賓影城股份有限公司台南東區分公司",
      "統一編號": 68071157,
      "廳數": 7,
      "地址": "台南市中華東路一段96號B1-16",
      "電話": "06-2347166",
      "備註": ""
    },
    {
      "事業名稱": "南台影城",
      "公司名稱": "南台育樂事業有限公司",
      "統一編號": 68456929,
      "廳數": 5,
      "地址": "台南市友愛街317號",
      "電話": "06-2287581",
      "備註": ""
    },
    {
      "事業名稱": "麻豆戲院",
      "公司名稱": "麻豆戲院",
      "統一編號": 87689080,
      "廳數": 2,
      "地址": "台南市麻豆區興中路106號3樓之1",
      "電話": "06-5722159",
      "備註": ""
    },
    {
      "事業名稱": "台南南紡夢時代威秀影城",
      "公司名稱": "威秀影城股份有限公司台南東區分公司",
      "統一編號": 54393381,
      "廳數": 10,
      "地址": "台南市東區中華東路一段366號5樓",
      "電話": "06-2372255",
      "備註": ""
    },
    {
      "事業名稱": "台南真善美劇院",
      "公司名稱": "中影股份有限公司台南延平分公司",
      "統一編號": 51446933,
      "廳數": 5,
      "地址": "台南市中西區西門路二段230號4樓",
      "電話": "06-2229768",
      "備註": ""
    },
    {
      "事業名稱": "台南仁德秀泰影城",
      "公司名稱": "台南仁德秀泰影城股份有限公司",
      "統一編號": 85079837,
      "廳數": 6,
      "地址": "臺南市仁德區仁愛里大同路三段759號2樓",
      "電話": "06-2691889",
      "備註": ""
    },
    {
      "事業名稱": "喜滿客夢時代影城",
      "公司名稱": "喜滿客京華城股份有限公司夢時代分公司",
      "統一編號": 28474605,
      "廳數": 12,
      "地址": "高雄市三民區十全一路161號地下1、2樓、2~5樓",
      "電話": "07-9702001",
      "備註": ""
    },
    {
      "事業名稱": "高雄台鋁秀泰影城",
      "公司名稱": "高雄台鋁秀泰影城股份有限公司",
      "統一編號": 90520657,
      "廳數": 10,
      "地址": "高雄市前鎮區忠勤路8號1-2樓",
      "電話": "07-5363898",
      "備註": ""
    },
    {
      "事業名稱": "高雄大遠百威秀影城",
      "公司名稱": "威秀影城股份有限公司高雄分公司",
      "統一編號": 12873991,
      "廳數": 16,
      "地址": "高雄市苓雅區三多四路21號13-16樓",
      "電話": "07-3345566",
      "備註": ""
    },
    {
      "事業名稱": "奧斯卡3D數位影城",
      "公司名稱": "東王大戲院股份有限公司",
      "統一編號": 28293843,
      "廳數": 3,
      "地址": "高雄市新興區仁智街287號B1.3樓",
      "電話": "07-2412128",
      "備註": ""
    },
    {
      "事業名稱": "奧斯卡3D數位影城",
      "公司名稱": "大西洋成股份有限公司",
      "統一編號": 28294792,
      "廳數": 2,
      "地址": "高雄市新興區仁智街287號2樓",
      "電話": "07-2412128",
      "備註": ""
    },
    {
      "事業名稱": "奧斯卡3D數位影城",
      "公司名稱": "西華戲院股份有限公司",
      "統一編號": 28294152,
      "廳數": 5,
      "地址": "高雄市新興區仁智街287號3.4樓",
      "電話": "07-2412128",
      "備註": ""
    },
    {
      "事業名稱": "環球影城",
      "公司名稱": "星球育樂有限公司",
      "統一編號": 16300355,
      "廳數": 9,
      "地址": "高雄市苓雅區大順三路108號3至4樓",
      "電話": "07-7220066",
      "備註": ""
    },
    {
      "事業名稱": "十全電影院",
      "公司名稱": "來來大戲院",
      "統一編號": 81850446,
      "廳數": 1,
      "地址": "高雄市三民區十全二路21號2樓",
      "電話": "07-3117141",
      "備註": ""
    },
    {
      "事業名稱": "十全電影院",
      "公司名稱": "博愛大戲院",
      "統一編號": 75978156,
      "廳數": 1,
      "地址": "高雄市三民區十全二路21號4-5樓",
      "電話": "07-3117141",
      "備註": ""
    },
    {
      "事業名稱": "十全電影院",
      "公司名稱": "錦元大戲院",
      "統一編號": 75978135,
      "廳數": 1,
      "地址": "高雄市三民區十全二路21號6樓",
      "電話": "07-3117141",
      "備註": ""
    },
    {
      "事業名稱": "十全電影院",
      "公司名稱": "威尼斯戲院",
      "統一編號": 18451569,
      "廳數": 1,
      "地址": "高雄市三民區十全二路21號8樓",
      "電話": "07-3117141",
      "備註": ""
    },
    {
      "事業名稱": "十全電影院",
      "公司名稱": "每益大戲院",
      "統一編號": 26022036,
      "廳數": 1,
      "地址": "高雄市三民區十全二路21號9樓",
      "電話": "07-3117141",
      "備註": ""
    },
    {
      "事業名稱": "岡山統一大戲院",
      "公司名稱": "國琪育樂有限公司",
      "統一編號": 7911799,
      "廳數": 3,
      "地址": "高雄市岡山區壽天路103之18號5樓",
      "電話": "07-6223300",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@高雄義大世界",
      "公司名稱": "國賓影城股份有限公司高雄義大分公司",
      "統一編號": 25113086,
      "廳數": 10,
      "地址": "高雄市大樹區學城路一段12號3樓、4樓",
      "電話": "07-6568368",
      "備註": ""
    },
    {
      "事業名稱": "in89駁二電影院",
      "公司名稱": "映捌玖數位影城有限公司高雄分公司",
      "統一編號": 42823415,
      "廳數": 7,
      "地址": "高雄市鹽埕區大勇路5之1號及5之2號",
      "電話": "07-9766088",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@高雄大魯閣草衙道",
      "公司名稱": "國賓影城股份有限公司高雄草衙道分公司",
      "統一編號": 43724883,
      "廳數": 10,
      "地址": "高雄市前鎮區中山四路100號3樓",
      "電話": "07-1933611",
      "備註": ""
    },
    {
      "事業名稱": "高雄大立in89豪華影城",
      "公司名稱": "豪華大戲院股份有限公司高雄分公司",
      "統一編號": 82816256,
      "廳數": 8,
      "地址": "高雄市前金區五福三路57號9～10樓",
      "電話": "07- 2166189",
      "備註": ""
    },
    {
      "事業名稱": "基隆秀泰影城",
      "公司名稱": "秀泰電影城",
      "統一編號": "09852233",
      "廳數": 7,
      "地址": "基隆市中正區信一路177號7-10樓",
      "電話": "02-24212388",
      "備註": ""
    },
    {
      "事業名稱": "桃園新光影城",
      "公司名稱": "新光影城股份有限公司-桃園青埔分公司",
      "統一編號": 83715707,
      "廳數": 12,
      "地址": "桃園市中壢區春德路107號1至6樓",
      "電話": "03-2873808",
      "備註": ""
    },
    {
      "事業名稱": "喜樂時代桃園A19影城",
      "公司名稱": "喜樂時代影城股份有限公司-桃園分公司",
      "統一編號": 90531248,
      "廳數": 16,
      "地址": "桃園市中壢區高鐵南路2段352號4樓",
      "電話": "03-2876625",
      "備註": ""
    },
    {
      "事業名稱": "美麗新台茂影城",
      "公司名稱": "歡影城股份有限公司",
      "統一編號": 16741796,
      "廳數": 14,
      "地址": "桃園市蘆竹區南崁路一段112號7、8樓",
      "電話": "03-3113123",
      "備註": ""
    },
    {
      "事業名稱": "in89統領影城",
      "公司名稱": "統領戲院",
      "統一編號": 16741796,
      "廳數": 4,
      "地址": "桃園市桃園區中正路56號3樓、5樓",
      "電話": "03-3329398",
      "備註": ""
    },
    {
      "事業名稱": "星橋國際影城",
      "公司名稱": "星橋電影有限公司",
      "統一編號": 36408571,
      "廳數": 16,
      "地址": "桃園市中壢區中園路2段501號4、5、6、7樓",
      "電話": "03-4680100",
      "備註": ""
    },
    {
      "事業名稱": "威尼斯影城",
      "公司名稱": "威尼斯影城股份有限公司",
      "統一編號": 12690563,
      "廳數": 10,
      "地址": "桃園市中壢區九和一街48號",
      "電話": "03-2805018",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@八德廣豐新天地",
      "公司名稱": "國賓影城股份有限公司八德分公司",
      "統一編號": 52382486,
      "廳數": 8,
      "地址": "桃園市八德區介壽路一段728號",
      "電話": "03-2182898",
      "備註": ""
    },
    {
      "事業名稱": "桃園統領威秀影城",
      "公司名稱": "威秀影城股份有限公司桃園統領分公司",
      "統一編號": 51821509,
      "廳數": 20,
      "地址": "桃園市桃園區中正路61號9、10、12樓",
      "電話": "03-3333232",
      "備註": ""
    },
    {
      "事業名稱": "國際戲院",
      "公司名稱": "新竹國際大戲院股份有限公司",
      "統一編號": 45044186,
      "廳數": 5,
      "地址": "新竹市文昌街39號2樓",
      "電話": "03-5222134",
      "備註": ""
    },
    {
      "事業名稱": "國際中興影城",
      "公司名稱": "國際中興影城有限公司",
      "統一編號": 46387907,
      "廳數": 3,
      "地址": "新竹市林森路32號7、8樓",
      "電話": "03-5237077",
      "備註": ""
    },
    {
      "事業名稱": "新竹大遠百威秀影城",
      "公司名稱": "威秀影城股份有限公司新竹南門分公司",
      "統一編號": 80728448,
      "廳數": 11,
      "地址": "新竹市西大路323號8、9、10、11樓",
      "電話": "03-5241166",
      "備註": ""
    },
    {
      "事業名稱": "新竹巨城威秀影城",
      "公司名稱": "威秀影城股份有限公司新竹巨城分公司",
      "統一編號": 80279913,
      "廳數": 8,
      "地址": "新竹市民權路176號4樓之3",
      "電話": "03-5346999",
      "備註": ""
    },
    {
      "事業名稱": "新復珍戲院",
      "公司名稱": "新復珍戲院股份有限公司",
      "統一編號": 80531780,
      "廳數": 2,
      "地址": "新竹市北門街6號4、5樓",
      "電話": "03-5248285",
      "備註": ""
    },
    {
      "事業名稱": "頭份尚順威秀影城",
      "公司名稱": "威秀影城股份有限公司苗栗頭份分公司",
      "統一編號": 24792875,
      "廳數": 8,
      "地址": "苗栗縣頭份鎮中央路105號7樓",
      "電話": "037-686866",
      "備註": ""
    },
    {
      "事業名稱": "台灣大戲院",
      "公司名稱": "台灣文化企業股份有限公司",
      "統一編號": 58651304,
      "廳數": 3,
      "地址": "彰化縣彰化市中正路二段48號",
      "電話": "04-7222213",
      "備註": ""
    },
    {
      "事業名稱": "員林大戲院",
      "公司名稱": "京讚育樂股份有限公司",
      "統一編號": 45106149,
      "廳數": 4,
      "地址": "彰化縣員林鎮南昌路39號3樓",
      "電話": "04-8351667",
      "備註": ""
    },
    {
      "事業名稱": "山明電影院",
      "公司名稱": "山明電影院",
      "統一編號": 78108870,
      "廳數": 2,
      "地址": "南投縣埔里鎮中正路二段389號4樓之2",
      "電話": "049-2997878",
      "備註": ""
    },
    {
      "事業名稱": "南投戲院",
      "公司名稱": "南投戲院",
      "統一編號": 61215101,
      "廳數": 3,
      "地址": "南投縣南投市大同街87號",
      "電話": "049-2242787",
      "備註": ""
    },
    {
      "事業名稱": "北港秀泰影城",
      "公司名稱": "北港秀泰影城股份有限公司",
      "統一編號": 83561013,
      "廳數": 4,
      "地址": "雲林縣北港鎮光復里華南路101號2樓",
      "電話": "05-7821895",
      "備註": ""
    },
    {
      "事業名稱": "白宮戲院",
      "公司名稱": "白宮戲院",
      "統一編號": 64155958,
      "廳數": 4,
      "地址": "雲林縣虎尾鎮中正路257號",
      "電話": "05-6322328",
      "備註": ""
    },
    {
      "事業名稱": "中華影城",
      "公司名稱": "中華影城",
      "統一編號": 87086308,
      "廳數": 8,
      "地址": "雲林縣斗六市雲林路二段19號",
      "電話": "05-5332660",
      "備註": ""
    },
    {
      "事業名稱": "嘉義影食匯in89豪華影城",
      "公司名稱": "豪華大戲院股份有限公司豪華大戲院嘉義分公司",
      "統一編號": 90837070,
      "廳數": 9,
      "地址": "嘉義市東區民族路328號",
      "電話": "05-2293189",
      "備註": ""
    },
    {
      "事業名稱": "嘉年華戲院",
      "公司名稱": "嘉年華戲院",
      "統一編號": 78550228,
      "廳數": 9,
      "地址": "嘉義市中山路617號4樓",
      "電話": "05-2250289",
      "備註": ""
    },
    {
      "事業名稱": "嘉義秀泰影城",
      "公司名稱": "嘉義秀泰影城股份有限公司",
      "統一編號": 42754199,
      "廳數": 11,
      "地址": "嘉義市西區文化路299號6樓",
      "電話": "05-2283838",
      "備註": ""
    },
    {
      "事業名稱": "中影屏東影城",
      "公司名稱": "中影股份有限公司屏東光華分公司",
      "統一編號": 28976895,
      "廳數": 8,
      "地址": "屏東縣屏東市民生路248號3、4樓",
      "電話": "08-7322043",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@屏東環球購物中心",
      "公司名稱": "國賓影城股份有限公司屏東分公司",
      "統一編號": 53955905,
      "廳數": 6,
      "地址": "屏東縣屏東市仁愛路90號6、7樓",
      "電話": "08-7662128",
      "備註": "友愛影城"
    },
    {
      "事業名稱": "友愛影城",
      "公司名稱": "友愛影城",
      "統一編號": 67902247,
      "廳數": 4,
      "地址": "宜蘭縣宜蘭市舊城東路50號7樓",
      "電話": "03-9315666",
      "備註": "日新戲院"
    },
    {
      "事業名稱": "日新大戲院",
      "公司名稱": "日新大戲院",
      "統一編號": 41562807,
      "廳數": 3,
      "地址": "宜蘭縣羅東鎮中山西街17 -1號",
      "電話": "03-9542835",
      "備註": "日新戲院-統一廳"
    },
    {
      "事業名稱": "統一戲院",
      "公司名稱": "統一戲院",
      "統一編號": 42076282,
      "廳數": 1,
      "地址": "宜蘭縣羅東鎮公園路100號3樓",
      "電話": "03-9566677",
      "備註": ""
    },
    {
      "事業名稱": "新月豪華影城",
      "公司名稱": "榮江股份有限公司新月影城分公司",
      "統一編號": 24562830,
      "廳數": 10,
      "地址": "宜蘭縣宜蘭市民權路二段38巷2號",
      "電話": "03-9328833",
      "備註": ""
    },
    {
      "事業名稱": "花蓮秀泰影城",
      "公司名稱": "花蓮電影城",
      "統一編號": 67946287,
      "廳數": 9,
      "地址": "花蓮縣花蓮市國聯五路69號4、5、6、7樓",
      "電話": "03-8337675",
      "備註": ""
    },
    {
      "事業名稱": "花蓮新天堂樂園威秀影城",
      "公司名稱": "台灣創新發展股份有限公司花蓮分公司",
      "統一編號": 24813822,
      "廳數": 9,
      "地址": "花蓮縣吉安鄉南濱路一段503號3-4樓",
      "電話": "03-8421133",
      "備註": ""
    },
    {
      "事業名稱": "台東秀泰影城",
      "公司名稱": "台東娛樂城股份有限公司",
      "統一編號": 53558413,
      "廳數": 8,
      "地址": "台東縣台東市新生路93號3樓",
      "電話": "089-327755",
      "備註": ""
    },
    {
      "事業名稱": "金獅影城",
      "公司名稱": "台灣創新發展股份有限公司",
      "統一編號": 28185226,
      "廳數": 6,
      "地址": "金門縣金湖鎮瓊林里中山路8之6號3、4樓",
      "電話": "082-330397",
      "備註": ""
    },
    {
      "事業名稱": "國賓影城@金門昇恆昌金湖廣場",
      "公司名稱": "國賓影城股份有限公司金門分公司",
      "統一編號": 24536904,
      "廳數": 6,
      "地址": "金門縣金湖鎮太湖路二段198號6樓",
      "電話": "082-330287",
      "備註": ""
    },
    {
      "事業名稱": "澎湖in89豪華影城",
      "公司名稱": "豪華大戲院股份有限公司澎湖分公司",
      "統一編號": 55664311,
      "廳數": 7,
      "地址": "澎湖縣馬公市同和路158號4樓",
      "電話": "06-9276189",
      "備註": ""
    }
  ];


  console.log(movieBud)








  



















// 六角
// const PostURL= 'https://image.tmdb.org/t/p/w500';
// let data;

// const list = document.querySelector(".list");
// function renderHTML(){
//     let str;
//     data.forEach(function(item){
//         const {title,poster_path,overview,release_date,vote_average
//         } = item;
//         str+=`
//         <img src="${PostURL+poster_path}" alt="image">
//         <div class="movieInfo">
//             <h3>${title}</h3>
//             <span class="green">評分</span>
//         </div>

//         <div class="date">
//             <p >發布日期</p>
//         </div>

//         <div class="overView">
//             <h3>overview</h3>
//             Lorem ipsum dolor sit amet, consectetur adipisicing elit. Minima sapiente nisi aut quo modi recusandae! Fugiat ducimus sunt facilis quis, eius magnam a iure tempora molestiae dolor, ullam ex et!
//         </div>`
//     });

//     list.innerHTML = str;
// }

// axios.get('https://api.themoviedb.org/3/discover/movie?api_key=5d7ac24e63419994fda11db9f90c8f2b&language=en-US&sort_by=popularity.desc&include_adult=false&include_video=false&page=1&year=2021&with_watch_monetization_types=flatrate')
// .then(function(response){
// console.log(response);
// data = response.data.results;
// console.log(data);
// renderHTML()

//   })

